app/Models/AuthModel.php

SELECT *
FROM `t_user`
WHERE `email` = 'admin@gmail.com'
AND `password` = 'd033e22ae348aeb5660fc2140aec35850c4da997'
---
    public function signin($email, $password)
    {
        return $this->db->table('t_user')->where(['email' => $email, 'password' => $password])->get()->getRowArray();