app/Models/CategoryModel.php

    public function getCategoryByInventory($id)
    {
        return $this->db->table('t_category')->where('code_sku', $id)->get()->getResult();
---
SELECT *
FROM `t_category`
WHERE `code_sku` = 'ABCDEFG'

    public function addCategory($data)
    {
        return $this->db->table('t_category')->set($data)->insert();
---
INSERT INTO `t_category` (`code_sku`, `nama`) VALUES ('ABCDEFG', 'Kain')

    public function deleteCategoryByInventory($id)
    {
        return $this->db->table('t_category')->where('code_sku', $id)->delete();
---
DELETE FROM `t_category`
WHERE `code_sku` = 'K01'