app/Models/InboundModel.php

    public function getInbound()
    {
        return $this->db
            ->table('t_inbound as in')
            ->select('in.id_inbound, in.date, in.code_sku,in.category, in.amount_unit, in.serial_number, u.id_user, u.nama, inv.type_of_material, inv.stock, inv.unit')
            ->join('t_user as u', 'in.id_user = u.id_user')
            ->join('t_inventory as inv', 'inv.code_sku = in.code_sku')
            ->get()
            ->getResult();
---
SELECT `in`.`id_inbound`, `in`.`date`, `in`.`code_sku`, `in`.`category`, `in`.`amount_unit`, `in`.`serial_number`, `u`.`id_user`, `u`.`nama`, `inv`.`type_of_material`, `inv`.`stock`, `inv`.`unit`
FROM `t_inbound` as `in`
JOIN `t_user` as `u` ON `in`.`id_user` = `u`.`id_user`
JOIN `t_inventory` as `inv` ON `inv`.`code_sku` = `in`.`code_sku`