app/Models/InventoryModel.php

    public function getInventory()
    {
        return $this->db->table('t_inventory')->get()->getResult();
---
SELECT *
FROM `t_inventory`

    public function getInventoryById($id)
    {
        return $this->db->table('t_inventory')->where('code_sku', $id)->get()->getRowArray();
---
SELECT *
FROM `t_inventory`
WHERE `code_sku` = 'K01'

    public function addInventory($data)
    {
        return $this->db->table('t_inventory')->set($data)->insert();
---
INSERT INTO `t_inventory` (`code_sku`, `type_of_material`, `stock`, `unit`) VALUES ('ABCDEFG', 'Kain', 0, 'Meter')

    public function deleteInventory($id)
    {
        return $this->db->table('t_inventory')->where('code_sku', $id)->delete();
---
DELETE FROM `t_inventory`
WHERE `code_sku` = 'K01'