app/Models/LogActivityModel.php

SELECT `log`.`id_log`, `log`.`date`, `log`.`action`, `u`.`id_user`, `u`.`nama`
FROM `t_log` as `log`
JOIN `t_user` as `u` ON `log`.`id_user` = `u`.`id_user`
---
    public function getLog()
    {
        return $this->db
            ->table('t_log as log')
            ->select('log.id_log, log.date, log.action, u.id_user, u.nama')
            ->join('t_user as u', 'log.id_user = u.id_user')
            ->get()
            ->getResult();

INSERT INTO `t_log` (`id_user`, `date`, `action`) VALUES ('1', '2025-06-29 15:09:23', 'Delete inventory Kain/K01')
---
    public function addLog($data)
    {
        return $this->db->table('t_log')->set($data)->insert();