app/Models/OutboundModel.php

SELECT `out`.`id_outbound`, `out`.`date`, `out`.`code_sku`, `out`.`category`, `out`.`amount_unit`, `out`.`serial_number`, `u`.`id_user`, `u`.`nama`, `inv`.`type_of_material`, `inv`.`stock`, `inv`.`unit`
FROM `t_outbound` as `out`
JOIN `t_user` as `u` ON `out`.`id_user` = `u`.`id_user`
JOIN `t_inventory` as `inv` ON `inv`.`code_sku` = `out`.`code_sku`
---
    public function getOutbound()
    {
        return $this->db
            ->table('t_outbound as out')
            ->select('out.id_outbound, out.date, out.code_sku, out.category, out.amount_unit, out.serial_number, u.id_user, u.nama, inv.type_of_material, inv.stock, inv.unit')
            ->join('t_user as u', 'out.id_user = u.id_user')
            ->join('t_inventory as inv', 'inv.code_sku = out.code_sku')
            ->get()
            ->getResult();

SELECT `out`.`id_outbound`, `out`.`date`, `out`.`code_sku`, `out`.`amount_unit`, `out`.`serial_number`, `u`.`id_user`, `u`.`nama`, `inv`.`type_of_material`, `inv`.`stock`, `inv`.`unit`
FROM `t_outbound` as `out`
JOIN `t_user` as `u` ON `out`.`id_user` = `u`.`id_user`
JOIN `t_inventory` as `inv` ON `inv`.`code_sku` = `out`.`code_sku`
WHERE `id_outbound` = '7'
---
    public function getOutboundById($id)
    {
        return $this->db->table('t_outbound as out')
            ->select('out.id_outbound, out.date, out.code_sku, out.category, out.amount_unit, out.serial_number, u.id_user, u.nama, inv.type_of_material, inv.stock, inv.unit')
            ->join('t_user as u', 'out.id_user = u.id_user')
            ->join('t_inventory as inv', 'inv.code_sku = out.code_sku')
            ->where('id_outbound', $id)->get()
            ->getRowArray();

DELETE FROM `t_outbound`
WHERE `id_outbound` = '7'
---
    public function deleteOutbound($id)
    {
        return $this->db->table('t_outbound')->where('id_outbound', $id)->delete();